[
  {
    "id": "p01",
    "peristiwa": "Benteng Portugis di Ternate",
    "penjajah": "Portugis",
    "lat": 0.791,
    "lng": 127.38,
    "tahun": 1522,
    "pic": "https://infopublik.id/assets/upload/headline//4-benteng-bersejarah-di-ternate-nomor-1-pernah-jadi-rebutan-4-negara-eropa-kKmRqZIKtO.jpg",
    "deskripsi_singkat": "Pada tahun 1522, Portugis membangun benteng di Ternate untuk menguasai jalur perdagangan rempah-rempah yang sangat strategis di Kepulauan Maluku. Benteng ini menjadi simbol kekuatan kolonial awal Eropa di Nusantara. Keberadaan mereka memicu ketegangan dengan kerajaan lokal, terutama Kesultanan Ternate dan Tidore, yang merasa kedaulatannya terancam. Portugis menerapkan sistem dagang yang merugikan rakyat lokal dan berupaya memonopoli cengkeh. Konflik pun sering terjadi antara Portugis dan penduduk setempat, termasuk perlawanan bersenjata. Selain menguasai ekonomi, Portugis juga menyebarkan agama Katolik di wilayah tersebut. Namun, dominasi mereka tidak bertahan lama karena digantikan oleh bangsa Spanyol, lalu Belanda yang datang belakangan. Warisan kehadiran Portugis masih terlihat dari arsitektur dan pengaruh budaya yang tersisa di Ternate hingga kini."
  },
  {
    "id": "p02",
    "peristiwa": "Pendirian Batavia oleh VOC",
    "penjajah": "Belanda (VOC)",
    "lat": -6.135,
    "lng": 106.817,
    "tahun": 1619,
    "pic": "https://upload.wikimedia.org/wikipedia/commons/5/58/AMH-6775-KB_Siege_of_Batavia_by_the_sultan_of_Mataram.jpg",
    "deskripsi_singkat": "VOC menghancurkan Kerajaan Jayakarta pada tahun 1619 dan mendirikan kota baru yang dinamai Batavia sebagai pusat pemerintahan dan perdagangan mereka di Hindia Timur. Batavia dirancang sebagai kota benteng dengan sistem kanal seperti kota-kota di Belanda. Kota ini berkembang menjadi pusat administrasi dan ekonomi kolonial, sekaligus simbol dominasi Belanda di Indonesia. Pendirian Batavia juga menandai dimulainya masa panjang penjajahan Belanda yang berlangsung lebih dari tiga abad. Dalam prosesnya, VOC kerap menggunakan taktik manipulasi politik, monopoli perdagangan, dan kekerasan untuk mempertahankan kekuasaan. Ribuan buruh dari berbagai daerah didatangkan secara paksa untuk membangun kota tersebut. Penyakit, eksploitasi, dan diskriminasi sosial menjadi bagian dari kehidupan rakyat kecil di Batavia. Warisan kolonial ini kemudian berkembang menjadi cikal bakal kota Jakarta modern."
  },
  {
    "id": "p03",
    "peristiwa": "Perang Diponegoro",
    "penjajah": "Belanda",
    "lat": -7.7956,
    "lng": 110.3695,
    "tahun": 1825,
    "pic": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/Raden_Saleh_-_Diponegoro_arrest.jpg/1200px-Raden_Saleh_-_Diponegoro_arrest.jpg",
    "deskripsi_singkat": "Perang Diponegoro terjadi antara tahun 1825 hingga 1830, dipimpin oleh Pangeran Diponegoro yang merasa terhina oleh intervensi Belanda dalam urusan adat Jawa, termasuk pembangunan jalan melewati makam leluhurnya. Perang ini menyebar luas di Jawa Tengah dan Yogyakarta, dan menjadi perlawanan terbesar terhadap Belanda pada abad ke-19. Belanda harus mengerahkan lebih dari 50.000 tentara dan menderita kerugian besar, baik secara ekonomi maupun militer. Strategi gerilya yang diterapkan pasukan Diponegoro membuat Belanda kesulitan menaklukkannya. Namun, akhirnya Diponegoro ditangkap secara licik dalam sebuah perundingan di Magelang. Perang ini menyebabkan lebih dari 200.000 kematian, termasuk rakyat sipil. Dampaknya besar terhadap perekonomian dan memperkuat niat Belanda untuk menerapkan sistem kontrol yang lebih ketat. Diponegoro sendiri menjadi simbol perlawanan nasional hingga kini."
  },
  {
    "id": "p04",
    "peristiwa": "Tanam Paksa (Cultuurstelsel)",
    "penjajah": "Belanda",
    "lat": -6.9175,
    "lng": 107.6191,
    "tahun": 1830,
        "pic": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQCn5JI6l1XVpvmXhReBTevgRk7hnU-iw8Vxw&s",
    "deskripsi_singkat": "Tanam Paksa (Cultuurstelsel) diberlakukan pada tahun 1830 oleh Gubernur Jenderal Johannes van den Bosch sebagai upaya mengisi kas Belanda yang kosong pasca kekalahan melawan Napoleon. Sistem ini mewajibkan rakyat Indonesia menanam komoditas ekspor seperti kopi, tebu, dan nila di sebagian besar tanah pertanian mereka. Hasilnya dikirim ke Belanda tanpa kompensasi yang layak. Sistem ini sangat merugikan petani, menyebabkan kelaparan, kemiskinan, dan kematian massal di beberapa daerah seperti Jawa Tengah dan Priangan. Meskipun memberikan keuntungan ekonomi besar bagi Belanda, sistem ini dikecam banyak pihak, termasuk oleh tokoh-tokoh Belanda sendiri. Eduard Douwes Dekker atau Multatuli kemudian menuliskan kisah ini dalam novel *Max Havelaar*, yang mengguncang opini publik Eropa. Akibat tekanan ini, sistem Tanam Paksa mulai dikurangi dan digantikan sistem ekonomi liberal. Namun dampaknya terhadap struktur sosial ekonomi Indonesia masih terasa lama."
  },
  {
    "id": "p05",
    "peristiwa": "Pendudukan Jepang",
    "penjajah": "Jepang",
    "lat": -6.2088,
    "lng": 106.8456,
    "tahun": 1942,

    "pic": "https://lh3.googleusercontent.com/pw/ADCreHevq4WkOmhS4KIBg2qJMtpw12BSUGJ3Cm4-SpsyRCjhWJLx1n23wnebmeeGVhahupK_nKc2aqqshiKvbgjDbQb3w_GQEtQHr74oiBQOSiuKeOH9cwI=w2400",
    "deskripsi_singkat": "Jepang menduduki Indonesia sejak 1942 setelah Belanda menyerah dalam Perang Dunia II. Pada awalnya, rakyat menyambut Jepang sebagai pembebas karena mengusir Belanda, namun harapan itu segera pupus. Jepang menerapkan pemerintahan militer yang keras, melakukan eksploitasi sumber daya, dan memaksa jutaan rakyat menjadi romusha (kerja paksa). Pendidikan dan kebebasan pers dibatasi, serta muncul kelaparan luas akibat distribusi pangan yang buruk. Namun, Jepang juga membuka kesempatan bagi tokoh nasionalis untuk tampil di pemerintahan, memberi pelatihan militer kepada pemuda, dan menyebarkan semangat Asia Timur Raya. Hal ini secara tidak langsung membangkitkan rasa nasionalisme dan kesiapan untuk merdeka. Menjelang akhir perang, Jepang menjanjikan kemerdekaan bagi Indonesia, meski dengan tujuan politik. Pendudukan ini berakhir pada 1945 dan menjadi salah satu pemicu kuat bagi proklamasi kemerdekaan Indonesia."
  }
]